jmeter/results/html-report/statistics.json
{
  "POST /auth/login" : {
    "transaction" : "POST /auth/login",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 84.06666666666666,
    "medianResTime" : 76.0,
    "minResTime" : 70.0,
    "maxResTime" : 321.0,
    "pct1ResTime" : 83.0,
    "pct2ResTime" : 190.64999999999984,
    "pct3ResTime" : 321.0,
    "throughput" : 6.530256856769699,
    "receivedKBytesPerSec" : 7.35929337178929,
    "sentKBytesPerSec" : 1.6899590498476271
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 120,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 22.74166666666667,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 321.0,
    "pct1ResTime" : 76.0,
    "pct2ResTime" : 79.0,
    "pct3ResTime" : 271.2299999999981,
    "throughput" : 25.745548165629693,
    "receivedKBytesPerSec" : 22.834926786097405,
    "sentKBytesPerSec" : 5.040998444539799
  },
  "GET /info" : {
    "transaction" : "GET /info",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1.7999999999999996,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 7.0,
    "pct1ResTime" : 2.900000000000002,
    "pct2ResTime" : 4.799999999999997,
    "pct3ResTime" : 7.0,
    "throughput" : 6.589062156819679,
    "receivedKBytesPerSec" : 6.813845266857017,
    "sentKBytesPerSec" : 1.145364320228421
  },
  "GET /health" : {
    "transaction" : "GET /health",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.0000000000000004,
    "medianResTime" : 2.0,
    "minResTime" : 1.0,
    "maxResTime" : 30.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 15.699999999999982,
    "pct3ResTime" : 30.0,
    "throughput" : 6.540222367560497,
    "receivedKBytesPerSec" : 3.2254026324395033,
    "sentKBytesPerSec" : 1.1496484630477437
  },
  "GET /plans" : {
    "transaction" : "GET /plans",
    "sampleCount" : 30,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.1000000000000005,
    "medianResTime" : 1.0,
    "minResTime" : 1.0,
    "maxResTime" : 23.0,
    "pct1ResTime" : 2.0,
    "pct2ResTime" : 11.449999999999985,
    "pct3ResTime" : 23.0,
    "throughput" : 6.5992080950285965,
    "receivedKBytesPerSec" : 5.896753327100748,
    "sentKBytesPerSec" : 1.1535725087989441
  }
}